{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Lowercase"
      },
      {
        "type": "NFKD"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "<s>",
        0.0
      ],
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "▁",
        -1.6743163344107614
      ],
      [
        "=",
        -3.282135097209549
      ],
      [
        ");",
        -3.5304585592418523
      ],
      [
        "}",
        -3.6167997102967355
      ],
      [
        "{",
        -3.6173937766088162
      ],
      [
        ";",
        -3.6576456246289926
      ],
      [
        ",",
        -4.075814752619522
      ],
      [
        "+",
        -4.223679882975967
      ],
      [
        "▁new",
        -4.341098899222661
      ],
      [
        "▁if",
        -4.623552493003844
      ],
      [
        ")",
        -4.720352405272532
      ],
      [
        "▁\"",
        -4.803063760770245
      ],
      [
        "s",
        -4.958847420519142
      ],
      [
        "(",
        -5.076327257707915
      ],
      [
        "▁string",
        -5.153689094985397
      ],
      [
        "▁(",
        -5.205452552472886
      ],
      [
        ".",
        -5.220257993019146
      ],
      [
        "\");",
        -5.305895410767315
      ],
      [
        "▁try",
        -5.3080602605392
      ],
      [
        "▁catch",
        -5.329451193288103
      ],
      [
        "i",
        -5.362376977625818
      ],
      [
        "▁file",
        -5.36466723299532
      ],
      [
        "_",
        -5.391441857911724
      ],
      [
        "▁null",
        -5.502523368524704
      ],
      [
        "▁!=",
        -5.5660854432707545
      ],
      [
        ".close();",
        -5.626167008197665
      ],
      [
        "\"",
        -5.689642309571264
      ],
      [
        "▁return",
        -5.700841235998833
      ],
      [
        "e)",
        -5.7144909327913105
      ],
      [
        ".get",
        -5.724818819652542
      ],
      [
        "▁null)",
        -5.755736231600061
      ],
      [
        "file",
        -5.803605956839016
      ],
      [
        "▁in",
        -5.830965754269968
      ],
      [
        ":",
        -5.882727587872331
      ],
      [
        "▁url",
        -5.888648565040523
      ],
      [
        "\",",
        -5.889468360509676
      ],
      [
        "p",
        -5.892629201877771
      ],
      [
        "▁public",
        -5.936810328080245
      ],
      [
        "exception",
        -5.944234141419484
      ],
      [
        "c",
        -5.962174937053351
      ],
      [
        "▁int",
        -5.987792478905128
      ],
      [
        "▁out",
        -6.011544658503059
      ],
      [
        "();",
        -6.014203768666485
      ],
      [
        "e",
        -6.032827312684491
      ],
      [
        "));",
        -6.059141935958367
      ],
      [
        ">",
        -6.101980823571479
      ],
      [
        "d",
        -6.11511460078539
      ],
      [
        "else",
        -6.115609698576167
      ],
      [
        "f",
        -6.153310508916556
      ],
      [
        "t",
        -6.161083496147542
      ],
      [
        "▁void",
        -6.183504825483
      ],
      [
        "▁throws",
        -6.199591350920404
      ],
      [
        "▁throw",
        -6.201618914015883
      ],
      [
        "a",
        -6.245550716551989
      ],
      [
        "r",
        -6.267304646086565
      ],
      [
        "<",
        -6.286626187074379
      ],
      [
        "▁==",
        -6.320110156750671
      ],
      [
        "▁while",
        -6.335521753772312
      ],
      [
        "▁for",
        -6.3506836702867435
      ],
      [
        "▁0;",
        -6.383374313363605
      ],
      [
        "name",
        -6.397067404091738
      ],
      [
        "(new",
        -6.397813937060624
      ],
      [
        "▁system.out.",
        -6.404119662873301
      ],
      [
        "-",
        -6.41154630666583
      ],
      [
        "fileoutputstream",
        -6.440192330162015
      ],
      [
        "b",
        -6.4699682376942125
      ],
      [
        "m",
        -6.517861630778123
      ],
      [
        "▁0)",
        -6.532120649360893
      ],
      [
        "▁static",
        -6.535753879091345
      ],
      [
        "1",
        -6.541651691702182
      ],
      [
        "()",
        -6.551705074782943
      ],
      [
        "id",
        -6.554719648503644
      ],
      [
        "▁(ioexception",
        -6.565061456596638
      ],
      [
        "2",
        -6.573191153141293
      ],
      [
        "▁inputstream",
        -6.585413858339903
      ],
      [
        "▁final",
        -6.606135397573757
      ],
      [
        "/",
        -6.610586070938233
      ],
      [
        "o",
        -6.612154745589443
      ],
      [
        "))",
        -6.615793611799852
      ],
      [
        "▁finally",
        -6.653374196098598
      ],
      [
        "▁ioexception",
        -6.654493246984064
      ],
      [
        "▁(exception",
        -6.66123106626128
      ],
      [
        "n",
        -6.678376323358423
      ],
      [
        "(\"",
        -6.681956753779602
      ],
      [
        ".set",
        -6.718577027777156
      ],
      [
        "println(\"",
        -6.727321479410669
      ],
      [
        "▁0,",
        -6.7332466120769645
      ],
      [
        "url",
        -6.743388233929643
      ],
      [
        "▁to",
        -6.765975326194948
      ],
      [
        "l",
        -6.7729744178227556
      ],
      [
        "▁fileinputstream",
        -6.787451144106621
      ],
      [
        "printstacktrace(",
        -6.82417781302045
      ],
      [
        "in",
        -6.836605771255522
      ],
      [
        "▁boolean",
        -6.84476523997421
      ],
      [
        "▁bufferedreader",
        -6.855016087714635
      ],
      [
        "inputstream",
        -6.874052253500482
      ],
      [
        "▁byte[]",
        -6.900518971625237
      ],
      [
        "&&",
        -6.900770332552053
      ],
      [
        "x",
        -6.908556413488643
      ],
      [
        "g",
        -6.917881012725314
      ],
      [
        "v",
        -6.924772656635204
      ],
      [
        "▁is",
        -6.933694433750199
      ],
      [
        "\"))",
        -6.965429904228339
      ],
      [
        "(string",
        -6.9741297555955715
      ],
      [
        "▁false",
        -6.977737030992616
      ],
      [
        "▁(int",
        -6.978700660259406
      ],
      [
        "to",
        -6.993413096675365
      ],
      [
        "data",
        -7.001429085681016
      ],
      [
        "outputstream",
        -7.013783384548029
      ],
      [
        "());",
        -7.023158287172297
      ],
      [
        "u",
        -7.0235931660916755
      ],
      [
        "▁not",
        -7.027937972335435
      ],
      [
        "▁get",
        -7.0385953108150545
      ],
      [
        "string",
        -7.05588758693758
      ],
      [
        "▁private",
        -7.071507021964377
      ],
      [
        "h",
        -7.083818730518695
      ],
      [
        "\")",
        -7.09604202399535
      ],
      [
        "new",
        -7.104854283057655
      ],
      [
        "0",
        -7.120498035551847
      ],
      [
        "ed",
        -7.125046993258621
      ],
      [
        "▁(!",
        -7.129636488213066
      ],
      [
        "]",
        -7.135211655337569
      ],
      [
        "path",
        -7.14350733569254
      ],
      [
        "▁read",
        -7.144516927178977
      ],
      [
        "3",
        -7.147864770763437
      ],
      [
        "▁filechannel",
        -7.14829930988031
      ],
      [
        "▁messagedigest",
        -7.163034824217615
      ],
      [
        "out",
        -7.174509683854533
      ],
      [
        "k",
        -7.185832746923378
      ],
      [
        "*",
        -7.18844352784839
      ],
      [
        "type",
        -7.207345765586224
      ],
      [
        ".tostring()",
        -7.210774423052753
      ],
      [
        "▁e.",
        -7.240968101299243
      ],
      [
        "||",
        -7.266207064504874
      ],
      [
        "(file",
        -7.266292848341083
      ],
      [
        "▁connection",
        -7.277272165892233
      ],
      [
        "byte)",
        -7.283069830772556
      ],
      [
        "▁conn",
        -7.283963327246081
      ],
      [
        "▁ex)",
        -7.312587402389196
      ],
      [
        "?",
        -7.312766576024686
      ],
      [
        "response",
        -7.318152062595278
      ],
      [
        "▁true;",
        -7.333669202391063
      ],
      [
        "▁dcmparser",
        -7.345662653587732
      ],
      [
        "algorithm",
        -7.350404566614346
      ],
      [
        "▁response",
        -7.353001427363205
      ],
      [
        "i++)",
        -7.3553570410771965
      ],
      [
        "dir",
        -7.363021610245051
      ],
      [
        "'",
        -7.364154673587027
      ],
      [
        "▁\"\"",
        -7.369481906738908
      ],
      [
        "▁from",
        -7.3774582791448875
      ],
      [
        "stream",
        -7.381843154366285
      ],
      [
        "re",
        -7.3819741585948915
      ],
      [
        "e);",
        -7.390957596576314
      ],
      [
        "list",
        -7.394261283739191
      ],
      [
        "ing",
        -7.395520427427607
      ],
      [
        "4",
        -7.398003481354225
      ],
      [
        "▁line",
        -7.422152031642614
      ],
      [
        "▁buffered",
        -7.424581847028161
      ],
      [
        "xml",
        -7.42870875017835
      ],
      [
        "▁src",
        -7.435153017785831
      ],
      [
        "request",
        -7.439801615472687
      ],
      [
        "▁result",
        -7.440654525841939
      ],
      [
        "▁source",
        -7.444810917842636
      ],
      [
        "index",
        -7.454711963388842
      ],
      [
        ").getchannel()",
        -7.465586122547251
      ],
      [
        "▁this.",
        -7.473504418846046
      ],
      [
        "info",
        -7.4766339191142155
      ],
      [
        ".length()",
        -7.478013831706173
      ],
      [
        "▁-1)",
        -7.487433322631903
      ],
      [
        "y",
        -7.487688767728647
      ],
      [
        "source",
        -7.4973716476841314
      ],
      [
        "error",
        -7.498497849082323
      ],
      [
        "get",
        -7.506122169550263
      ],
      [
        "▁long",
        -7.512595238118433
      ],
      [
        "&",
        -7.519759773177309
      ],
      [
        "reader",
        -7.5217028640287715
      ],
      [
        "▁reader",
        -7.535908237375786
      ],
      [
        "filename",
        -7.539326486615076
      ],
      [
        "z",
        -7.577543876021991
      ],
      [
        "▁1)",
        -7.5843962729851455
      ],
      [
        "er",
        -7.585314463951265
      ],
      [
        "▁j",
        -7.58946510568844
      ],
      [
        ".getname()",
        -7.596480223420892
      ],
      [
        "str",
        -7.5985065653664865
      ],
      [
        "▁output",
        -7.599656248332467
      ],
      [
        "text",
        -7.602649696897675
      ],
      [
        "▁>>",
        -7.60636967366176
      ],
      [
        "[",
        -7.613864341870846
      ],
      [
        "is",
        -7.614452715003109
      ],
      [
        "outputstream(new",
        -7.62020566619443
      ],
      [
        "value",
        -7.628026823013471
      ],
      [
        "▁outputstream",
        -7.636065508332861
      ],
      [
        "▁file(",
        -7.645548485993421
      ],
      [
        "w",
        -7.649825735123581
      ],
      [
        "▁out.write((",
        -7.6503331228216975
      ],
      [
        "key",
        -7.650969773044851
      ],
      [
        "url.openstream()",
        -7.66096951412818
      ],
      [
        ".openconnection(",
        -7.675325049303581
      ],
      [
        "password",
        -7.69179264798905
      ],
      [
        "time",
        -7.692212341274642
      ],
      [
        "sqlexception",
        -7.707841616564213
      ],
      [
        "▁bytearray",
        -7.712080759894743
      ],
      [
        "▁destination",
        -7.71242258611168
      ],
      [
        "code",
        -7.7155765720645295
      ],
      [
        "j",
        -7.717934776049862
      ],
      [
        "input",
        -7.724546839272181
      ],
      [
        "[]",
        -7.736497320293697
      ],
      [
        "▁md",
        -7.737789454853521
      ],
      [
        "writer",
        -7.7417894781594185
      ],
      [
        "user",
        -7.742978164816657
      ],
      [
        "▁http",
        -7.760294181269424
      ],
      [
        "table",
        -7.761526803401438
      ],
      [
        "▁buffer",
        -7.761575854898073
      ],
      [
        "size",
        -7.769281867780178
      ],
      [
        "encoding",
        -7.778197376304345
      ],
      [
        ".flush(",
        -7.782507004577697
      ],
      [
        "image",
        -7.785972148803095
      ],
      [
        "▁pxlen",
        -7.786045764031053
      ],
      [
        "channel",
        -7.80197167480225
      ],
      [
        "▁((",
        -7.803094815528398
      ],
      [
        "▁the",
        -7.807568855692367
      ],
      [
        "entry",
        -7.812147188246421
      ],
      [
        ".getbytes()",
        -7.821833460164401
      ],
      [
        "line",
        -7.8330686589046525
      ],
      [
        "1,",
        -7.840544780270518
      ],
      [
        "map",
        -7.847019031678158
      ],
      [
        "al",
        -7.85030666844313
      ],
      [
        "▁out.write(",
        -7.860625121067988
      ],
      [
        "▁request",
        -7.865115604488599
      ],
      [
        "▁con",
        -7.865770186163061
      ],
      [
        "▁system.err.",
        -7.8668430170628305
      ],
      [
        "▁image",
        -7.869660915940283
      ],
      [
        "or",
        -7.874649535094344
      ],
      [
        "bytes",
        -7.876772690859545
      ],
      [
        "5",
        -7.880380191792648
      ],
      [
        ".size()",
        -7.883799998582145
      ],
      [
        "▁input",
        -7.885658199955618
      ],
      [
        "class",
        -7.887642120081107
      ],
      [
        "count",
        -7.889552639231496
      ],
      [
        "▁messagedigest.",
        -7.890487017343267
      ],
      [
        "server",
        -7.891080677790908
      ],
      [
        "directory",
        -7.893727287424033
      ],
      [
        "▁break",
        -7.904341084645578
      ],
      [
        ".executeupdate(",
        -7.912435727607127
      ],
      [
        "())",
        -7.913980816457933
      ],
      [
        "at",
        -7.9141157756352065
      ],
      [
        "array",
        -7.915095587328262
      ],
      [
        "▁writer",
        -7.916798370576208
      ],
      [
        "[i]",
        -7.927871358247229
      ],
      [
        "content",
        -7.930787070228185
      ],
      [
        ".length",
        -7.933316589601892
      ],
      [
        "▁stmt",
        -7.942189167247312
      ],
      [
        "outputstream(",
        -7.944228828672729
      ],
      [
        "base",
        -7.951528627224377
      ],
      [
        "\\\"",
        -7.968948486753938
      ],
      [
        "▁fos",
        -7.968982852624649
      ],
      [
        "test",
        -7.977503912686181
      ],
      [
        "set",
        -7.980255354753085
      ],
      [
        "from",
        -7.981161652011579
      ],
      [
        "▁stringbuffer",
        -7.9872485680320615
      ],
      [
        "message",
        -7.989752879028098
      ],
      [
        "▁ps",
        -7.992190893391307
      ],
      [
        "hash",
        -7.993080281949695
      ],
      [
        "read",
        -7.995247692541506
      ],
      [
        "▁data",
        -8.002439745241924
      ],
      [
        "location",
        -8.00345822818261
      ],
      [
        "log",
        -8.01293949035081
      ],
      [
        "factory",
        -8.02113146190164
      ],
      [
        "on",
        -8.022123329404222
      ],
      [
        "▁buf",
        -8.023709771251209
      ],
      [
        "result",
        -8.023790424570016
      ],
      [
        "item",
        -8.030491828175776
      ],
      [
        "folder",
        -8.031007796539054
      ],
      [
        "http",
        -8.031022842976004
      ],
      [
        "fileinputstream(",
        -8.049140854771107
      ],
      [
        "q",
        -8.054074985271411
      ],
      [
        ".add",
        -8.055552171554682
      ],
      [
        "getinstance(\"md5",
        -8.060599972593993
      ],
      [
        "service",
        -8.063719636000966
      ],
      [
        "▁copy",
        -8.063849011941006
      ],
      [
        ".getinputstream(",
        -8.065862739141469
      ],
      [
        "connection",
        -8.068738129325704
      ],
      [
        "▁ds",
        -8.069475511169387
      ],
      [
        "node",
        -8.0696964340477
      ],
      [
        "println(",
        -8.072401065318267
      ],
      [
        "end",
        -8.072710632585599
      ],
      [
        "▁dest",
        -8.083102897753102
      ],
      [
        "▁(nosuch",
        -8.084652642194918
      ],
      [
        "resource",
        -8.087741481321743
      ],
      [
        "▁ioutils.copy(",
        -8.089985744750999
      ],
      [
        "▁filename",
        -8.098097123530518
      ],
      [
        "uri",
        -8.098224055565286
      ],
      [
        "▁string[]",
        -8.098645814863469
      ],
      [
        "▁digest",
        -8.103211562669731
      ],
      [
        "▁'\"",
        -8.1045822313191
      ],
      [
        "date",
        -8.108251488395055
      ],
      [
        "output",
        -8.112123629295706
      ],
      [
        "▁-1",
        -8.115671905837809
      ],
      [
        "files",
        -8.119744961410602
      ],
      [
        "▁temp",
        -8.122086394175742
      ],
      [
        "db",
        -8.131035603673151
      ],
      [
        "pxlen",
        -8.135364568483743
      ],
      [
        "version",
        -8.136071728236157
      ],
      [
        "urlconnection",
        -8.136413759635305
      ],
      [
        "▁and",
        -8.14259702692081
      ],
      [
        "action",
        -8.143067835745093
      ],
      [
        "▁do",
        -8.143860874139754
      ],
      [
        "object",
        -8.145088563435655
      ],
      [
        "ar",
        -8.145145410061707
      ],
      [
        "▁sql",
        -8.148861286170748
      ],
      [
        "no",
        -8.150785695787965
      ],
      [
        "8",
        -8.156144261854427
      ],
      [
        "context",
        -8.159078525388235
      ],
      [
        "!\"",
        -8.166040102565319
      ],
      [
        "an",
        -8.167124416711951
      ],
      [
        "format",
        -8.16904433806493
      ],
      [
        "▁@",
        -8.174684510428644
      ],
      [
        "reparedstatement",
        -8.176006053207514
      ],
      [
        "▁ds.getint(tags.",
        -8.176886865769921
      ],
      [
        "as",
        -8.178582174762333
      ],
      [
        "number",
        -8.186565380463213
      ],
      [
        "▁md.update(",
        -8.192398459982643
      ],
      [
        "st",
        -8.193185519973389
      ],
      [
        "▁stringbuffer();",
        -8.197250319379984
      ],
      [
        "▁byte",
        -8.200472558127576
      ],
      [
        "(),",
        -8.20067029802806
      ],
      [
        "buffer",
        -8.204872849208384
      ],
      [
        "(string)",
        -8.205834502430639
      ],
      [
        "doc",
        -8.20630620336419
      ],
      [
        "start",
        -8.206319141602778
      ],
      [
        "update",
        -8.208520391506132
      ],
      [
        "s.",
        -8.20959928695592
      ],
      [
        "method",
        -8.213193120471395
      ],
      [
        "▁urlconnection",
        -8.222261342378388
      ],
      [
        "▁hash",
        -8.222604755209963
      ],
      [
        "en",
        -8.222737740128284
      ],
      [
        "▁bufferedinput",
        -8.248026246036236
      ],
      [
        "(url",
        -8.25509610826555
      ],
      [
        "ch",
        -8.257253773698286
      ],
      [
        ".getabsolutepath",
        -8.25809632686423
      ],
      [
        "▁java.io.",
        -8.258363131073668
      ],
      [
        "model",
        -8.260463279032853
      ],
      [
        "9",
        -8.263413182010785
      ],
      [
        "it",
        -8.266326923785241
      ],
      [
        "▁tmp",
        -8.270300312885379
      ],
      [
        "tmp",
        -8.271130676643073
      ],
      [
        "default",
        -8.279956492055462
      ],
      [
        "os",
        -8.281242143476378
      ],
      [
        "override",
        -8.282361491739488
      ],
      [
        "▁set",
        -8.285260517688982
      ],
      [
        "▁content",
        -8.292336161218667
      ],
      [
        "group",
        -8.298876926391472
      ],
      [
        ".equals(",
        -8.29888906919645
      ],
      [
        "▁1;",
        -8.305862721504285
      ],
      [
        "▁\":",
        -8.30893929260232
      ],
      [
        "header",
        -8.310137140717112
      ],
      [
        "▁create",
        -8.315509432445563
      ],
      [
        "page",
        -8.316648617219684
      ],
      [
        "▁exc)",
        -8.317063303796472
      ],
      [
        "zip",
        -8.322546073760266
      ],
      [
        "putstreamreader(",
        -8.330986500019865
      ],
      [
        "element",
        -8.33105918463455
      ],
      [
        "▁success",
        -8.331293587766078
      ],
      [
        ".add(",
        -8.338531516274863
      ],
      [
        "null,",
        -8.341810987017094
      ],
      [
        "▁\"/\"",
        -8.344243505354624
      ],
      [
        ".exists())",
        -8.344352469283455
      ],
      [
        "status",
        -8.345536860666186
      ],
      [
        "src",
        -8.352262533594105
      ],
      [
        "stream(new",
        -8.352995433866381
      ],
      [
        "▁ds.putui(tags.s",
        -8.352999870662408
      ],
      [
        "haspixeldata",
        -8.353082811566717
      ],
      [
        "▁md5",
        -8.354515004764552
      ],
      [
        "exception(\"",
        -8.354985138404084
      ],
      [
        "▁tags.pixeldata",
        -8.35833719829688
      ],
      [
        "etdcmhandler(",
        -8.358339395753546
      ],
      [
        "document",
        -8.358597459732733
      ],
      [
        "true)",
        -8.363500006652574
      ],
      [
        "un",
        -8.368889300030869
      ],
      [
        "▁!",
        -8.371893845493958
      ],
      [
        "7",
        -8.372140610516377
      ],
      [
        "(final",
        -8.37481895347271
      ],
      [
        "▁res",
        -8.377500366604368
      ],
      [
        ".getchannel()",
        -8.38160862021924
      ],
      [
        "false",
        -8.38451316406811
      ],
      [
        "▁object",
        -8.389749150088939
      ],
      [
        ".append(",
        -8.394346702342906
      ],
      [
        "query",
        -8.403512046511995
      ],
      [
        "▁ioexception(\"",
        -8.409597831791908
      ],
      [
        ".getpath()",
        -8.412507913486975
      ],
      [
        "runtimeexception",
        -8.41338784363175
      ],
      [
        ".equals(\"",
        -8.413794478265801
      ],
      [
        "▁entry",
        -8.415209423981846
      ],
      [
        "and",
        -8.4184861608149
      ],
      [
        "▁infile",
        -8.418710508852183
      ],
      [
        "▁convert",
        -8.421030081409352
      ],
      [
        "▁e.getmessage()",
        -8.424548687409446
      ],
      [
        "2,",
        -8.424622773797187
      ],
      [
        "temp",
        -8.426442394460983
      ],
      [
        "urlconnection)",
        -8.427485949853665
      ],
      [
        "_name",
        -8.42845229331561
      ],
      [
        "▁url(",
        -8.430547839512382
      ],
      [
        "▁ioutils.",
        -8.430619338721106
      ],
      [
        "[0]",
        -8.430747015020978
      ],
      [
        "grlen",
        -8.43398845873421
      ],
      [
        "▁message",
        -8.437071990944034
      ],
      [
        "event",
        -8.437336634024597
      ],
      [
        "▁of",
        -8.437863817721684
      ],
      [
        ".substring(0,",
        -8.441963204312591
      ],
      [
        "copy",
        -8.442887885229498
      ],
      [
        "3,",
        -8.448132714970429
      ],
      [
        "im",
        -8.450492179522813
      ],
      [
        "▁statement",
        -8.455302445565465
      ],
      [
        "▁protected",
        -8.45546034877238
      ],
      [
        "client",
        -8.456821480816862
      ],
      [
        "login",
        -8.45919847058964
      ],
      [
        "▁srcchannel",
        -8.460857963804418
      ],
      [
        "field",
        -8.461428107034974
      ],
      [
        "ioexception",
        -8.46219947052794
      ],
      [
        "ex",
        -8.463538183361054
      ],
      [
        ".substring(",
        -8.464953920022257
      ],
      [
        "▁where",
        -8.465629243422853
      ],
      [
        "false)",
        -8.470574074197458
      ],
      [
        "▁error",
        -8.475677130862753
      ],
      [
        "download",
        -8.477047579000269
      ],
      [
        "▁\"'",
        -8.480458920061634
      ],
      [
        "name,",
        -8.484835023234236
      ],
      [
        "otfoundexception",
        -8.485731630955696
      ],
      [
        "▁16)",
        -8.496987960021974
      ],
      [
        "▁fis",
        -8.497403418888528
      ],
      [
        ".commit()",
        -8.497604049669738
      ],
      [
        "▁((line",
        -8.500048321569182
      ],
      [
        "pos",
        -8.501252859823767
      ],
      [
        "outputstream()",
        -8.501387786049829
      ],
      [
        "▁document",
        -8.502038110039678
      ],
      [
        "ftp",
        -8.50249285308673
      ],
      [
        "▁zipentry",
        -8.503608766490048
      ],
      [
        "ca",
        -8.509992846385703
      ],
      [
        "io",
        -8.515895406911762
      ],
      [
        "▁copyfile(file",
        -8.516091442116025
      ],
      [
        "icon",
        -8.53028008221635
      ],
      [
        "teger.parseint(",
        -8.530686006047407
      ],
      [
        "▁(http",
        -8.530918005249614
      ],
      [
        "▁md.digest()",
        -8.532334721292992
      ],
      [
        "post",
        -8.533928848912057
      ],
      [
        "ent",
        -8.534827349791591
      ],
      [
        ".is",
        -8.535761688018834
      ],
      [
        ":\"",
        -8.535777136050987
      ],
      [
        "host",
        -8.536090059144666
      ],
      [
        "me",
        -8.536314460694236
      ],
      [
        "msg",
        -8.541830611201998
      ],
      [
        ".write(",
        -8.542010414826542
      ],
      [
        "all",
        -8.542697476916892
      ],
      [
        "▁str",
        -8.544402272115828
      ],
      [
        "▁\"utf-8\")",
        -8.545314287779386
      ],
      [
        "num",
        -8.546760020577732
      ],
      [
        "().get",
        -8.547360256961511
      ],
      [
        "file.exists())",
        -8.548863300146884
      ],
      [
        "true",
        -8.549582354973834
      ],
      [
        "▁into",
        -8.54988176315497
      ],
      [
        "▁outchannel",
        -8.55206211290466
      ],
      [
        "▁log.debug(\"",
        -8.555851073441655
      ],
      [
        "6",
        -8.556590138096077
      ],
      [
        "▁dstchannel",
        -8.558598235118149
      ],
      [
        "▁rs",
        -8.559671796973772
      ],
      [
        "▁write",
        -8.565732848377358
      ],
      [
        "▁inchannel",
        -8.567046948885324
      ],
      [
        "target",
        -8.570276383449224
      ],
      [
        "le",
        -8.57189206213332
      ],
      [
        "link",
        -8.574175181517539
      ],
      [
        "s[i]",
        -8.576502950069797
      ],
      [
        "|",
        -8.576952960098046
      ],
      [
        "▁key",
        -8.577617152941254
      ],
      [
        "▁1]",
        -8.579578068348095
      ],
      [
        "\\\\",
        -8.58192746961177
      ],
      [
        "ok",
        -8.583158788516602
      ],
      [
        "handler",
        -8.583745505867139
      ],
      [
        "con",
        -8.584020541822973
      ],
      [
        "▁out.write(b",
        -8.58488122900154
      ],
      [
        "of",
        -8.587016699339962
      ],
      [
        "sql",
        -8.588613160888961
      ],
      [
        "_id",
        -8.593301344649033
      ],
      [
        "mode",
        -8.594971023294987
      ],
      [
        "▁\".",
        -8.59558245758245
      ],
      [
        "utils.",
        -8.59822976336234
      ],
      [
        "▁bufferedwriter",
        -8.598271446672394
      ],
      [
        "▁default",
        -8.599257363177673
      ],
      [
        "▁java.io.file",
        -8.599588002798603
      ],
      [
        ".getparameter(\"",
        -8.610195021530485
      ],
      [
        "▁byte[",
        -8.611739815942759
      ],
      [
        "byte",
        -8.611745556716196
      ],
      [
        "▁values",
        -8.614062029369995
      ],
      [
        "▁target",
        -8.61608663967242
      ],
      [
        "▁file.separator",
        -8.617961009340945
      ],
      [
        "html",
        -8.618196752767943
      ],
      [
        ".readline())",
        -8.618393746968335
      ],
      [
        "▁outfile",
        -8.618639584651847
      ],
      [
        "▁user",
        -8.620315401768119
      ],
      [
        "\\n\"",
        -8.620405327451017
      ],
      [
        "home",
        -8.623035407938717
      ],
      [
        "▁\"\\n\"",
        -8.624073474495109
      ],
      [
        "this",
        -8.626423098035671
      ],
      [
        "photo",
        -8.628722130171015
      ],
      [
        "jar",
        -8.629003264665258
      ],
      [
        "▁double",
        -8.6324873895963
      ],
      [
        "s.contains(tags.",
        -8.63312454501855
      ],
      [
        "do",
        -8.634044151220783
      ],
      [
        "command",
        -8.635516862775342
      ],
      [
        "println(\"\\n\"",
        -8.635659505275527
      ],
      [
        "▁test",
        -8.63629063289357
      ],
      [
        "▁(line",
        -8.63688729981571
      ],
      [
        "bitsallocated",
        -8.63805153956393
      ],
      [
        ".isdirectory())",
        -8.639253066889744
      ],
      [
        "numberofsamples",
        -8.64070973907247
      ],
      [
        "▁list",
        -8.641342601507345
      ],
      [
        "▁uid(",
        -8.641400085796809
      ],
      [
        "properties",
        -8.642096901453419
      ],
      [
        "▁os",
        -8.642355536549937
      ],
      [
        ".trim()",
        -8.645289078736512
      ],
      [
        ".setautocommit(",
        -8.646007251269559
      ],
      [
        "filecopy",
        -8.646335420667215
      ],
      [
        "state",
        -8.646680988317003
      ],
      [
        "▁ds.write",
        -8.64794391174766
      ],
      [
        "▁password",
        -8.648644698370497
      ],
      [
        "▁status",
        -8.650745326119207
      ],
      [
        "▁(in",
        -8.65102872615215
      ],
      [
        "▁dcmencparam",
        -8.651413282732388
      ],
      [
        ".getreadvr()",
        -8.651413293380521
      ],
      [
        "cache",
        -8.651908191376366
      ],
      [
        "config",
        -8.652766428146524
      ],
      [
        "▁resource",
        -8.654911619322315
      ],
      [
        "manager",
        -8.655664315826987
      ],
      [
        "▁0x",
        -8.656185976643991
      ],
      [
        "▁\"/",
        -8.66034208823785
      ],
      [
        "▁sb",
        -8.660533405863983
      ],
      [
        "length",
        -8.66363888871864
      ],
      [
        "max",
        -8.663796754372443
      ],
      [
        "n't",
        -8.666992796980642
      ],
      [
        ".class",
        -8.667033089157888
      ],
      [
        "token",
        -8.668852798929093
      ],
      [
        "delete",
        -8.671653564568917
      ],
      [
        "inputstream(",
        -8.672214319065773
      ],
      [
        "check",
        -8.672987122470643
      ],
      [
        "de",
        -8.674799815995247
      ],
      [
        "requestproperty(",
        -8.675033477290416
      ],
      [
        "digest",
        -8.675342238851497
      ],
      [
        "project",
        -8.679617476737668
      ],
      [
        "▁my",
        -8.683154770612385
      ],
      [
        "search",
        -8.684351263197188
      ],
      [
        "▁continue",
        -8.685366494768273
      ],
      [
        ".getparentfile()",
        -8.68916498201163
      ],
      [
        "▁len",
        -8.689427607111098
      ],
      [
        "▁update",
        -8.689440200130358
      ],
      [
        "▁current",
        -8.692022211958477
      ],
      [
        "▁log",
        -8.695302320658133
      ],
      [
        "(in",
        -8.696128907940711
      ],
      [
        "for",
        -8.696527643271315
      ],
      [
        "rgumentexception",
        -8.698197673998436
      ],
      [
        "▁in.read(",
        -8.69950106594913
      ],
      [
        ".transferto(0",
        -8.701674277612087
      ],
      [
        "▁httpclient",
        -8.70283847225578
      ],
      [
        "plugin",
        -8.705245532912768
      ],
      [
        "▁3)",
        -8.706650023447603
      ],
      [
        "write",
        -8.707114561681252
      ],
      [
        "▁parent",
        -8.70820024643435
      ],
      [
        "▁client",
        -8.711327781308235
      ],
      [
        "▁pstmt",
        -8.712722948565185
      ],
      [
        "▁ioe)",
        -8.713754189176326
      ],
      [
        ".equals",
        -8.714460675709493
      ],
      [
        "▁(filen",
        -8.718505436123884
      ],
      [
        "entity",
        -8.721995514710617
      ],
      [
        "▁load",
        -8.723126757031233
      ],
      [
        ".readline()",
        -8.725607060177973
      ],
      [
        "5,",
        -8.730004437834937
      ],
      [
        "▁size",
        -8.730133630164199
      ],
      [
        "lexception",
        -8.73337069786003
      ],
      [
        "▁httpservlet",
        -8.738173114148665
      ],
      [
        "▁path",
        -8.73851851679849
      ],
      [
        "op",
        -8.739238912266332
      ],
      [
        "▁req",
        -8.741879164911547
      ],
      [
        "▁ftp",
        -8.742301431730157
      ],
      [
        "▁sourcechannel",
        -8.74320014075719
      ],
      [
        "_failure",
        -8.745358492356512
      ],
      [
        "util.",
        -8.745790422806003
      ],
      [
        "▁zip",
        -8.746668281795758
      ],
      [
        "▁br",
        -8.748330310164054
      ],
      [
        "errorcount",
        -8.748384191452407
      ],
      [
        "▁directory",
        -8.750666847495811
      ],
      [
        "4,",
        -8.75118743021284
      ],
      [
        "...",
        -8.751619013954906
      ],
      [
        "▁e1)",
        -8.753225250740059
      ],
      [
        "root",
        -8.755758998676814
      ],
      [
        "body",
        -8.756464367196417
      ],
      [
        "session",
        -8.758976342442107
      ],
      [
        "ac",
        -8.761055596020663
      ],
      [
        "',",
        -8.762061893761045
      ],
      [
        "▁((read",
        -8.763864192578811
      ],
      [
        "▁date",
        -8.766390061038496
      ],
      [
        "ra",
        -8.771765118631908
      ],
      [
        "constants.",
        -8.775383189436111
      ],
      [
        "se",
        -8.776907994753545
      ],
      [
        "urrenttimemillis",
        -8.777144671499915
      ],
      [
        "(errorcount",
        -8.777214181184606
      ],
      [
        "▁be",
        -8.778003965615659
      ],
      [
        ".transferfrom(",
        -8.779180837284965
      ],
      [
        "0,",
        -8.780622454440158
      ],
      [
        "▁case",
        -8.782784159189998
      ],
      [
        "total",
        -8.784778618995938
      ],
      [
        "10",
        -8.785015234291434
      ],
      [
        ".getinstance()",
        -8.785858042975315
      ],
      [
        "tr",
        -8.78723758691772
      ],
      [
        "▁ftpclient",
        -8.790806230112564
      ],
      [
        "</",
        -8.792667642124592
      ],
      [
        "preparestatement",
        -8.79571861228046
      ],
      [
        "id,",
        -8.799024879633826
      ],
      [
        ".\"",
        -8.80049802568998
      ],
      [
        "record",
        -8.801247069470358
      ],
      [
        ".create",
        -8.803103449127684
      ],
      [
        "int",
        -8.804202575410889
      ],
      [
        "▁integer",
        -8.804458894584632
      ],
      [
        "ion",
        -8.804555457404918
      ],
      [
        "▁server",
        -8.807494027413494
      ],
      [
        "tag",
        -8.81344955742465
      ],
      [
        "md5",
        -8.813981955613803
      ],
      [
        "property",
        -8.815762149016752
      ],
      [
        "show",
        -8.8160007420467
      ],
      [
        "(true)",
        -8.818331268183695
      ],
      [
        "el",
        -8.818755614397102
      ],
      [
        ".startswith(\"",
        -8.819351164186742
      ],
      [
        "by",
        -8.824725339685902
      ],
      [
        "▁(malformedur",
        -8.824958102963182
      ],
      [
        "▁(i",
        -8.82935696367369
      ],
      [
        "(dest",
        -8.829466205491666
      ],
      [
        "provider",
        -8.833040316892975
      ],
      [
        "instanceof",
        -8.839419813438512
      ],
      [
        "java.io.buffered",
        -8.84002666438917
      ],
      [
        "▁8)",
        -8.842644048694412
      ],
      [
        "if",
        -8.843789460325207
      ],
      [
        "la",
        -8.843984035265514
      ],
      [
        "▁destfile",
        -8.84413531512725
      ],
      [
        "java",
        -8.844611664477075
      ],
      [
        "sub",
        -8.844919424826125
      ],
      [
        "com",
        -8.848062069396718
      ],
      [
        "schema",
        -8.849640958094879
      ],
      [
        "out.write(buffer",
        -8.853333230389484
      ],
      [
        "!",
        -8.854495776259807
      ],
      [
        "next",
        -8.85847348029446
      ],
      [
        ".write(buffer",
        -8.859885642625834
      ],
      [
        "failed",
        -8.85995959169928
      ],
      [
        "s.length",
        -8.862149744774452
      ],
      [
        "up",
        -8.86236256752198
      ],
      [
        "▁st",
        -8.862682856257354
      ],
      [
        "res",
        -8.863743008014813
      ],
      [
        "▁arraylist",
        -8.863949115303615
      ],
      [
        "▁dataset",
        -8.864015074468403
      ],
      [
        "▁session",
        -8.864092412091777
      ],
      [
        "is.close();",
        -8.864880976554726
      ],
      [
        "system",
        -8.870374914825433
      ],
      [
        "e.getmessage()",
        -8.873104778381695
      ],
      [
        "builder",
        -8.873291969220984
      ],
      [
        "▁log.info(\"",
        -8.874379870458712
      ],
      [
        "s()",
        -8.876436006874302
      ],
      [
        "▁db",
        -8.876845346981524
      ],
      [
        "/\"",
        -8.879777401594271
      ],
      [
        "report",
        -8.87992893298233
      ],
      [
        "system.out.print",
        -8.880496813293135
      ],
      [
        "script",
        -8.882592816025225
      ],
      [
        "not",
        -8.884374134109557
      ],
      [
        ".mkdirs()",
        -8.885297690688873
      ],
      [
        "▁dest)",
        -8.88560310529452
      ],
      [
        "▁properties",
        -8.885709094539658
      ],
      [
        "local",
        -8.886250613114415
      ],
      [
        "▁4)",
        -8.886288772348015
      ],
      [
        "raw",
        -8.889222642333587
      ],
      [
        "▁xml",
        -8.896731572893083
      ],
      [
        "▁fc",
        -8.89769092916122
      ],
      [
        "template",
        -8.900434163897785
      ],
      [
        "▁outfile)",
        -8.900902285646332
      ],
      [
        "part",
        -8.901537491447707
      ],
      [
        "createstatement(",
        -8.902476702345318
      ],
      [
        "▁project",
        -8.904191747112082
      ],
      [
        "\"),",
        -8.90521373349457
      ],
      [
        "title",
        -8.907960348738799
      ],
      [
        "li",
        -8.90816839460358
      ],
      [
        "port",
        -8.912355717280668
      ],
      [
        "...\"",
        -8.914214176267503
      ],
      [
        "form",
        -8.914229587154168
      ],
      [
        "buf",
        -8.914425372662125
      ],
      [
        "address",
        -8.914438350130471
      ],
      [
        "dao",
        -8.921193016205445
      ],
      [
        "parent",
        -8.921789979040486
      ],
      [
        "sbvaluebeforemd5",
        -8.922141532339415
      ],
      [
        ".rollback(",
        -8.923410670613395
      ],
      [
        "rows",
        -8.923710882096278
      ],
      [
        "▁httpresponse",
        -8.924157551677892
      ],
      [
        "▁zipinputstream",
        -8.92571774165108
      ],
      [
        "▁(java.lang.",
        -8.926581959613172
      ],
      [
        "val",
        -8.926747126378418
      ],
      [
        "debug",
        -8.92789045980824
      ],
      [
        "▁zipoutputstream",
        -8.929189180365062
      ],
      [
        "▁(is",
        -8.934754564977322
      ],
      [
        "▁value",
        -8.935131229605117
      ],
      [
        ".delete(",
        -8.93541414564973
      ],
      [
        "loc",
        -8.935712709622694
      ],
      [
        "▁fos.close();",
        -8.937782152700024
      ],
      [
        "long.tostring(",
        -8.93913213836862
      ],
      [
        "▁(null",
        -8.939655615422248
      ],
      [
        "▁logger.error(\"",
        -8.939704395622421
      ],
      [
        "len",
        -8.939861503142767
      ],
      [
        "(infile))",
        -8.941725028730515
      ],
      [
        "▁false,",
        -8.941923518769766
      ],
      [
        ".getproperty(\"",
        -8.941972796221984
      ],
      [
        "use",
        -8.941974256285766
      ],
      [
        "▁logger.info(\"",
        -8.943092644964217
      ],
      [
        "▁bytesread",
        -8.945234506213339
      ],
      [
        "▁jar",
        -8.945841698818036
      ],
      [
        "▁check",
        -8.947340540939464
      ],
      [
        "▁download",
        -8.94752194446237
      ],
      [
        ".indexof(\"",
        -8.952073972447279
      ],
      [
        "configuration",
        -8.95327776129171
      ],
      [
        "inputstream(src)",
        -8.95362557870641
      ],
      [
        "▁method",
        -8.955230842260011
      ],
      [
        "em",
        -8.956457169707837
      ],
      [
        "string(",
        -8.957493471494336
      ],
      [
        "▁?,",
        -8.958701158631577
      ],
      [
        "file.getname()",
        -8.959756034686695
      ],
      [
        ".getstring(\"",
        -8.959793729932008
      ],
      [
        "create",
        -8.96054683376526
      ],
      [
        "▁stream",
        -8.96217009545812
      ],
      [
        "▁this",
        -8.96370604328353
      ],
      [
        "(source",
        -8.964091796137822
      ],
      [
        ".setattribute(\"",
        -8.96416501910782
      ],
      [
        "filter",
        -8.966452079523426
      ],
      [
        ">\"",
        -8.967564207229369
      ],
      [
        "[1]",
        -8.96968436211012
      ],
      [
        "ge",
        -8.970468628759617
      ],
      [
        "param",
        -8.971084139079943
      ],
      [
        "bean",
        -8.97217674803178
      ],
      [
        "▁stringbuilder",
        -8.975048936034906
      ],
      [
        "dest",
        -8.975060967464422
      ],
      [
        "frame",
        -8.976254052644698
      ],
      [
        ".connect(",
        -8.977473962556143
      ],
      [
        "▁byte[1024]",
        -8.977892337714714
      ],
      [
        "archive",
        -8.978331829157584
      ],
      [
        "s();",
        -8.978580378031648
      ],
      [
        "last",
        -8.981430801332552
      ],
      [
        "upload",
        -8.981966671793
      ],
      [
        "▁24)",
        -8.983526166110423
      ],
      [
        "▁delete",
        -8.984467838623534
      ],
      [
        "▁ex",
        -8.986685096801036
      ],
      [
        "filename)",
        -8.987127116600465
      ],
      [
        "▁(!d",
        -8.98849700392526
      ],
      [
        "▁fin",
        -8.991953052947888
      ],
      [
        "▁\"...\"",
        -8.992634739778067
      ],
      [
        "fboundsexception",
        -8.994365709785635
      ],
      [
        "outo",
        -8.995144985311095
      ],
      [
        "equestdispatcher",
        -8.99592855582053
      ],
      [
        "▁args)",
        -8.997797777734052
      ],
      [
        "▁close",
        -8.999277714081838
      ],
      [
        "▁start",
        -9.000697790615733
      ],
      [
        "able",
        -9.001605413736273
      ],
      [
        "encode",
        -9.002975164692257
      ],
      [
        "▁dispatcher",
        -9.006459119316506
      ],
      [
        "ut",
        -9.007337817885002
      ],
      [
        "per",
        -9.008110111442752
      ],
      [
        "▁m_",
        -9.008443446130842
      ],
      [
        "▁illegala",
        -9.008704250786204
      ],
      [
        "point",
        -9.008954537981957
      ],
      [
        ".createnewfile()",
        -9.009348681685683
      ],
      [
        "params",
        -9.009556343723881
      ],
      [
        "▁inputline",
        -9.009646238992202
      ],
      [
        "my",
        -9.010849762741076
      ],
      [
        "package",
        -9.011819248917334
      ],
      [
        "auth",
        -9.011940871253312
      ],
      [
        "▁count",
        -9.01373835633943
      ],
      [
        "▁element",
        -9.015240036418582
      ],
      [
        ".update(",
        -9.020762905579742
      ],
      [
        "dataset(",
        -9.02084708984219
      ],
      [
        "▁0x0f)",
        -9.020961038169828
      ],
      [
        "(e);",
        -9.021301482626384
      ],
      [
